In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

pd.set_option("display.max_columns", None)

df = pd.read_csv("../data/credit_data.csv")
df.head()

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education
3,3,45,male,2,free,little,little,7882,42,furniture/equipment
4,4,53,male,2,free,little,little,4870,24,car

In [7]:
print("Shape:", df.shape)
df.columns

Shape: (1000, 10)

Index(['Unnamed: 0', 'Age', 'Sex', 'Job', 'Housing', 'Saving accounts',
       'Checking account', 'Credit amount', 'Duration', 'Purpose'],
      dtype='object')

In [8]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        1000 non-null   int64
 1   Age               1000 non-null   int64
 2   Sex               1000 non-null   object
 3   Job               1000 non-null   int64
 4   Housing           1000 non-null   object
 5   Saving accounts   817 non-null    object
 6   Checking account  606 non-null    object
 7   Credit amount     1000 non-null   int64
 8   Duration          1000 non-null   int64
 9   Purpose           1000 non-null   object
dtypes: int64(5), object(5)
memory usage: 78.3+ KB

Unnamed: 0            0
Age                   0
Sex                   0
Job                   0
Housing               0
Saving accounts     183
Checking account    394
Credit amount         0
Duration              0
Purpose               0
dtype: int64

In [9]:
df['Saving accounts']=df['Saving accounts'].fillna('unknown')
df['Checking account']=df['Checking account'].fillna('unknown')
df[['Saving accounts','Checking account']].isnull().sum()

Saving accounts     0
Checking account    0
dtype: int64

In [10]:
# First 5 rows, all columns
df.iloc[:5, :]

# All rows, first 3 columns
df.iloc[:, :3]

# All rows, last column (your target)
df.iloc[:, -1].value_counts()

Purpose
car                    337
radio/TV               280
furniture/equipment    181
business                97
education               59
repairs                 22
domestic appliances     12
vacation/others         12
Name: count, dtype: int64

In [11]:
cat_cols = ['Sex', 'Housing', 'Job', 'Purpose', 'Saving accounts', 'Checking account']

for col in cat_cols:
    print(f"\n{col.upper()}")
    print(df[col].value_counts())

SEX
Sex
male      690
female    310
Name: count, dtype: int64

HOUSING
Housing
own     713
rent    179
free    108
Name: count, dtype: int64

JOB
Job
2    630
1    200
3    148
0     22
Name: count, dtype: int64

PURPOSE
Purpose
car                    337
radio/TV               280
furniture/equipment    181
business                97
education               59
repairs                 22
domestic appliances     12
vacation/others         12
Name: count, dtype: int64

SAVING ACCOUNTS
Saving accounts
little        603
unknown       183
moderate      103
quite rich     63
rich           48
Name: count, dtype: int64

CHECKING ACCOUNT
Checking account
unknown     394
little      274
moderate    269
rich         63
Name: count, dtype: int64

In [12]:
import os
os.getcwd()

'/Users/shivamsharma/Desktop/credit_risk_ml_pipeline-main/notebooks'

In [14]:
df = pd.read_csv("../data/credit_data.csv")
df.head()

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education
3,3,45,male,2,free,little,little,7882,42,furniture/equipment
4,4,53,male,2,free,little,little,4870,24,car

In [17]:
df.to_csv("../data/processed/credit_clean.csv", index=False)
print("Saved OK")

Saved OK